app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("hospital_id", "name", "degree", "speciality", "experiance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["hospital_id", 1], ["name", ""], ["degree", "MBBS"], ["speciality", "heart"], ["experiance", 1], ["created_at", "2022-04-27 07:48:02.603775"], ["updated_at", "2022-04-27 07:48:02.603775"]]
---
  def create
    @doctor = @hospital.doctors.new(doctor_params)

    if @doctor.save

UPDATE "doctors" SET "name" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["name", "1"], ["updated_at", "2022-04-27 09:41:16.799515"], ["id", 2]]
---
  def update
    if @doctor.update(doctor_params)

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_doctor
      @doctor = Doctor.find(params[:id])

SELECT "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_hospital
      hospital_id = params.require(:hospital_id)
      @hospital = Hospital.find_by!(id: hospital_id)